# IS 362 - Project 4: scikit-learn

To begin, I will import the pandas module and additional modules.

In [ ]:
import pandas as pd
from sklearn import metrics
from sklearn.cross_validation import train_test_split
from sklearn.linear_model import LinearRegression

Set some pandas options for controlling output display.

In [ ]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

Then create the SQL query and execute.

In [3]:
sql = '''SELECT
        c.LastName, c.FirstName, t.Name, a.Title
        FROM Customer as c
        JOIN Invoice as i
        ON c.CustomerId = i.CustomerId
        JOIN InvoiceLine as il
        ON i.InvoiceId = il.InvoiceId
        JOIN Track as t
        ON il.TrackId = t.TrackId
        JOIN Album as a
        ON t.AlbumID = a.AlbumId
        ORDER BY c.LastName, c.FirstName'''
pd.read_sql(sql, db).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas